compare_strings:
    mov cx, 0           ; Завдання лічильника

compare_loop:
    mov al, [si]        ; Завантаження символа з першого рядка
    mov bl, [di]        ; Завантаження символа з другого рядка
    cmp al, bl          ; Порівняння символів
    jne strings_not_equal   ; Якщо символи не рівні, виходимо з циклу

    ; Перевірка кінця рядків
    cmp al, 0           ; Перевіряємо чи досягнутий кінець першого рядка
    je end_compare      ; Якщо так, завершуємо порівняння

    ; Якщо не досягнутий кінець, переходимо до наступного символа
    inc si
    inc di
    jmp compare_loop   ; Повторюємо порівняння наступних символів

strings_not_equal:
    ; Якщо символи не рівні, встановлюємо флаг нуля
    ; і завершуємо порівняння
    mov zf, 0
    ret

end_compare:
    ; Якщо досягнуті кінці обох рядків, встановлюємо флаг нуля,
    ; оскільки рядки рівні, і завершуємо порівняння
    mov zf, 1
    ret
