.model small
.stack 100h

.data
oneChar db ?

.code
main:
    ; Виведення символу '0' в stdout
    mov ah, 02h       ; Завантажуємо код функції для виводу символу
    mov dl, '0'       ; Завантажуємо ASCII-код символу '0' у регістр DL
    int 21h           ; Викликаємо DOS-функцію для виводу символу
    
    ; Читання символів з stdin до досягнення кінця файлу (EOF)
read_next:
    mov ah, 3Fh       ; Завантажуємо код функції для читання з файлу
    mov bx, 0         ; stdin handle
    mov cx, 1         ; 1 байт для читання
    mov dx, offset oneChar ; Адреса, куди зберігатиметься прочитаний символ
    int 21h           ; Викликаємо DOS-функцію для читання символу
    ; Опрацьовуємо прочитаний символ (oneChar)
    
    or ax, ax         ; Перевірка на кінець файлу (EOF)
    jnz read_next     ; Якщо файл ще не закінчився, повторюємо читання

    ; Кінець програми
    mov ah, 4Ch       ; Код функції для завершення програми
    int 21h           ; Викликаємо DOS-функцію для завершення програми

end main
